#coding=utf-8

#链接字符串的三种方法------------------------------------------------
#1,遍历链接，效率最低，不建议
a = ['a','b','c','d']
content = ''
for i in a:
  content = content + i
print("遍历链接字符串：",content)

#使用join
content = ''.join(a)
print("join链接字符串：",content)

#tuple占位符链接字符串
content = ('%s%s%s%s' % tuple(a))
print(content)
#__________________________________________________________________

#使用“+”
str1 = "adcd"
str2 = "efgh"
s3 = str1 + str2
print("+:",s3)

#,号隔开,返回一个元祖
s4 = "a","bc"
print(",:",s4)

# python 独有的，只要把两个字符串放在一起，中间有空白或者没有空白：两个字符串自动连接为一个字符串：
s5 = "我就是""一匹披着羊皮的浪"
print("两个字符串放在一起自动连接为一个字符串:",s5)


#用符号“%”连接一个字符串和一组变量，字符串中的特殊标记会被自动用右边变量组中的变量替换
#这种方式，右边是元组格式
s6 = ('%s %s' % ('Jim', 'Green'))
print("使用%：",s6)

#*乘法
print("##"*30)










